#include <stdio.h>

//실습문제 1
/*int main(void){
  printf("%d년 %d학기\n 프로그래밍실습\n %d학점, 이론 %d시간, 실습 %d시간 ",2021, 1, 3, 2, 2);
    return 0;
  }
*/
//실습문제 2
 /* int main(void){
    printf("*  *\n *  *\n *\n *  *\n *  * ");
      return 0;
    }
*/
//실습문제 3
/*int main(void){
    printf("세드나(%d Senda)는 그 궤도가 태양계 외곽에 미치는 커다란 소행성체로, 태양으로부터 %d 천문단위(AU),", 90377, 86);
    printf("즉 해왕성보다 세 배 더 멀리 떨어져 있다. 분광석분석 겨과 세드나의 표면은 주로 물, 메탄, 질소, 얼음, 톨린 등이 혼합되어 있어 다른 해왕성 바깥 천체 중 가장 붉은 축에 속한다.");
    printf("세두나의 표면은 태양계 천체 중 가장 붉은 축에 속한다. 유력한 왜행성 후보이기도 하다.");
  }
  */

//실습문제 4
/*int main(void){
  printf("%d * %d = %d/n",2,1,2*1);
  printf("%d * %d = %d/n",2,2,2*2);
  printf("%d * %d = %d/n",2,3,2*3);
  printf("%d * %d = %d/n",2,4,2*4);
  printf("%d * %d = %d/n",2,5,2*5);
  printf("%d * %d = %d/n",2,6,2*6);
  printf("%d * %d = %d/n",2,7,2*7);
  printf("%d * %d = %d/n",2,8,2*8);
  printf("%d * %d = %d",2,9,2*9);
}
  */

//실습문제 5
/*int main(void){
  printf("%d초를 %d으로 나누면 몫이 %d, 나머지 이다.\n", 1000, 3600, 2, 2800);
  printf("%d을 %d으로 나누면 몫이 %d, 나머지가 %d이다.",2800, 60, 46, 40);
  printf("따라서 %d초는 %d시간 %d분 %d초이다.",10000, 2, 46, 40);
} 
*/

//실습문제 6번
/*int main(void){
  printf("%d를 (%d+%d+%d)로 나눈 몫은 %d, 나머지는 %d이다./n");
  printf("그러므로 자식들 몫은 %d억원, 기부금은 %d억원이다./n");

} */